Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gpg064.h
extern volatile __OFF009bits_t OFF009bits __asm__ ("OFF009") __attribute__((section("sfrs"), address(0xBF810564)));
#define OFF010 OFF010
extern volatile uint32_t   OFF010 __attribute__((section("sfrs"), address(0xBF810568)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF010bits_t;
extern volatile __OFF010bits_t OFF010bits __asm__ ("OFF010") __attribute__((section("sfrs"), address(0xBF810568)));
#define OFF011 OFF011
extern volatile uint32_t   OFF011 __attribute__((section("sfrs"), address(0xBF81056C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF011bits_t;
extern volatile __OFF011bits_t OFF011bits __asm__ ("OFF011") __attribute__((section("sfrs"), address(0xBF81056C)));
#define OFF012 OFF012
extern volatile uint32_t   OFF012 __attribute__((section("sfrs"), address(0xBF810570)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF012bits_t;
extern volatile __OFF012bits_t OFF012bits __asm__ ("OFF012") __attribute__((section("sfrs"), address(0xBF810570)));
#define OFF013 OFF013
extern volatile uint32_t   OFF013 __attribute__((section("sfrs"), address(0xBF810574)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF013bits_t;
extern volatile __OFF013bits_t OFF013bits __asm__ ("OFF013") __attribute__((section("sfrs"), address(0xBF810574)));
#define OFF014 OFF014
extern volatile uint32_t   OFF014 __attribute__((section("sfrs"), address(0xBF810578)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF014bits_t;
extern volatile __OFF014bits_t OFF014bits __asm__ ("OFF014") __attribute__((section("sfrs"), address(0xBF810578)));
#define OFF015 OFF015
extern volatile uint32_t   OFF015 __attribute__((section("sfrs"), address(0xBF81057C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF015bits_t;
extern volatile __OFF015bits_t OFF015bits __asm__ ("OFF015") __attribute__((section("sfrs"), address(0xBF81057C)));
#define OFF016 OFF016
extern volatile uint32_t   OFF016 __attribute__((section("sfrs"), address(0xBF810580)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF016bits_t;
extern volatile __OFF016bits_t OFF016bits __asm__ ("OFF016") __attribute__((section("sfrs"), address(0xBF810580)));
#define OFF017 OFF017
extern volatile uint32_t   OFF017 __attribute__((section("sfrs"), address(0xBF810584)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF017bits_t;
extern volatile __OFF017bits_t OFF017bits __asm__ ("OFF017") __attribute__((section("sfrs"), address(0xBF810584)));
#define OFF018 OFF018
extern volatile uint32_t   OFF018 __attribute__((section("sfrs"), address(0xBF810588)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF018bits_t;
extern volatile __OFF018bits_t OFF018bits __asm__ ("OFF018") __attribute__((section("sfrs"), address(0xBF810588)));
#define OFF019 OFF019
extern volatile uint32_t   OFF019 __attribute__((section("sfrs"), address(0xBF81058C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF019bits_t;
extern volatile __OFF019bits_t OFF019bits __asm__ ("OFF019") __attribute__((section("sfrs"), address(0xBF81058C)));
#define OFF020 OFF020
extern volatile uint32_t   OFF020 __attribute__((section("sfrs"), address(0xBF810590)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF020bits_t;
extern volatile __OFF020bits_t OFF020bits __asm__ ("OFF020") __attribute__((section("sfrs"), address(0xBF810590)));
#define OFF021 OFF021
extern volatile uint32_t   OFF021 __attribute__((section("sfrs"), address(0xBF810594)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF021bits_t;
extern volatile __OFF021bits_t OFF021bits __asm__ ("OFF021") __attribute__((section("sfrs"), address(0xBF810594)));
#define OFF022 OFF022
extern volatile uint32_t   OFF022 __attribute__((section("sfrs"), address(0xBF810598)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF022bits_t;
extern volatile __OFF022bits_t OFF022bits __asm__ ("OFF022") __attribute__((section("sfrs"), address(0xBF810598)));
#define OFF023 OFF023
extern volatile uint32_t   OFF023 __attribute__((section("sfrs"), address(0xBF81059C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF023bits_t;
extern volatile __OFF023bits_t OFF023bits __asm__ ("OFF023") __attribute__((section("sfrs"), address(0xBF81059C)));
#define OFF024 OFF024
extern volatile uint32_t   OFF024 __attribute__((section("sfrs"), address(0xBF8105A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF024bits_t;
extern volatile __OFF024bits_t OFF024bits __asm__ ("OFF024") __attribute__((section("sfrs"), address(0xBF8105A0)));
#define OFF025 OFF025
extern volatile uint32_t   OFF025 __attribute__((section("sfrs"), address(0xBF8105A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF025bits_t;
extern volatile __OFF025bits_t OFF025bits __asm__ ("OFF025") __attribute__((section("sfrs"), address(0xBF8105A4)));
#define OFF026 OFF026
extern volatile uint32_t   OFF026 __attribute__((section("sfrs"), address(0xBF8105A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF026bits_t;
extern volatile __OFF026bits_t OFF026bits __asm__ ("OFF026") __attribute__((section("sfrs"), address(0xBF8105A8)));
#define OFF027 OFF027
extern volatile uint32_t   OFF027 __attribute__((section("sfrs"), address(0xBF8105AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF027bits_t;
extern volatile __OFF027bits_t OFF027bits __asm__ ("OFF027") __attribute__((section("sfrs"), address(0xBF8105AC)));
#define OFF030 OFF030
extern volatile uint32_t   OFF030 __attribute__((section("sfrs"), address(0xBF8105B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF030bits_t;
extern volatile __OFF030bits_t OFF030bits __asm__ ("OFF030") __attribute__((section("sfrs"), address(0xBF8105B8)));
#define OFF031 OFF031
extern volatile uint32_t   OFF031 __attribute__((section("sfrs"), address(0xBF8105BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF031bits_t;
extern volatile __OFF031bits_t OFF031bits __asm__ ("OFF031") __attribute__((section("sfrs"), address(0xBF8105BC)));
#define OFF032 OFF032
extern volatile uint32_t   OFF032 __attribute__((section("sfrs"), address(0xBF8105C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF032bits_t;
