Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gpg064.h
extern volatile __DAC2CONbits_t DAC2CONbits __asm__ ("DAC2CON") __attribute__((section("sfrs"), address(0xBF82C600)));
extern volatile uint32_t        DAC2CONCLR __attribute__((section("sfrs"),address(0xBF82C604)));
extern volatile uint32_t        DAC2CONSET __attribute__((section("sfrs"),address(0xBF82C608)));
extern volatile uint32_t        DAC2CONINV __attribute__((section("sfrs"),address(0xBF82C60C)));
#define CTMUCON CTMUCON
extern volatile uint32_t   CTMUCON __attribute__((section("sfrs"), address(0xBF82D000)));
typedef union {
  struct {
    uint32_t IRNG:2;
    uint32_t ITRIM:6;
    uint32_t CTTRIG:1;
    uint32_t IDISSEN:1;
    uint32_t EDGSEQEN:1;
    uint32_t EDGEN:1;
    uint32_t TGEN:1;
    uint32_t CTMUSIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t EDG2SEL:4;
    uint32_t EDG2POL:1;
    uint32_t EDG2MOD:1;
    uint32_t EDG1STAT:1;
    uint32_t EDG2STAT:1;
    uint32_t EDG1SEL:4;
    uint32_t EDG1POL:1;
    uint32_t EDG1MOD:1;
  };
  struct {
    uint32_t w:32;
  };
} __CTMUCONbits_t;
extern volatile __CTMUCONbits_t CTMUCONbits __asm__ ("CTMUCON") __attribute__((section("sfrs"), address(0xBF82D000)));
extern volatile uint32_t        CTMUCONCLR __attribute__((section("sfrs"),address(0xBF82D004)));
extern volatile uint32_t        CTMUCONSET __attribute__((section("sfrs"),address(0xBF82D008)));
extern volatile uint32_t        CTMUCONINV __attribute__((section("sfrs"),address(0xBF82D00C)));
#define CLC1CON CLC1CON
extern volatile uint32_t   CLC1CON __attribute__((section("sfrs"), address(0xBF82D200)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC1CONbits_t;
extern volatile __CLC1CONbits_t CLC1CONbits __asm__ ("CLC1CON") __attribute__((section("sfrs"), address(0xBF82D200)));
extern volatile uint32_t        CLC1CONCLR __attribute__((section("sfrs"),address(0xBF82D204)));
extern volatile uint32_t        CLC1CONSET __attribute__((section("sfrs"),address(0xBF82D208)));
extern volatile uint32_t        CLC1CONINV __attribute__((section("sfrs"),address(0xBF82D20C)));
#define CLC1SEL CLC1SEL
extern volatile uint32_t   CLC1SEL __attribute__((section("sfrs"), address(0xBF82D210)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC1SELbits_t;
extern volatile __CLC1SELbits_t CLC1SELbits __asm__ ("CLC1SEL") __attribute__((section("sfrs"), address(0xBF82D210)));
extern volatile uint32_t        CLC1SELCLR __attribute__((section("sfrs"),address(0xBF82D214)));
extern volatile uint32_t        CLC1SELSET __attribute__((section("sfrs"),address(0xBF82D218)));
extern volatile uint32_t        CLC1SELINV __attribute__((section("sfrs"),address(0xBF82D21C)));
#define CLC1GLS CLC1GLS
extern volatile uint32_t   CLC1GLS __attribute__((section("sfrs"), address(0xBF82D220)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC1GLSbits_t;
extern volatile __CLC1GLSbits_t CLC1GLSbits __asm__ ("CLC1GLS") __attribute__((section("sfrs"), address(0xBF82D220)));
extern volatile uint32_t        CLC1GLSCLR __attribute__((section("sfrs"),address(0xBF82D224)));
extern volatile uint32_t        CLC1GLSSET __attribute__((section("sfrs"),address(0xBF82D228)));
extern volatile uint32_t        CLC1GLSINV __attribute__((section("sfrs"),address(0xBF82D22C)));
#define CLC2CON CLC2CON
extern volatile uint32_t   CLC2CON __attribute__((section("sfrs"), address(0xBF82D400)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC2CONbits_t;
extern volatile __CLC2CONbits_t CLC2CONbits __asm__ ("CLC2CON") __attribute__((section("sfrs"), address(0xBF82D400)));
extern volatile uint32_t        CLC2CONCLR __attribute__((section("sfrs"),address(0xBF82D404)));
extern volatile uint32_t        CLC2CONSET __attribute__((section("sfrs"),address(0xBF82D408)));
extern volatile uint32_t        CLC2CONINV __attribute__((section("sfrs"),address(0xBF82D40C)));
#define CLC2SEL CLC2SEL
extern volatile uint32_t   CLC2SEL __attribute__((section("sfrs"), address(0xBF82D410)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC2SELbits_t;
extern volatile __CLC2SELbits_t CLC2SELbits __asm__ ("CLC2SEL") __attribute__((section("sfrs"), address(0xBF82D410)));
extern volatile uint32_t        CLC2SELCLR __attribute__((section("sfrs"),address(0xBF82D414)));
extern volatile uint32_t        CLC2SELSET __attribute__((section("sfrs"),address(0xBF82D418)));
extern volatile uint32_t        CLC2SELINV __attribute__((section("sfrs"),address(0xBF82D41C)));
#define CLC2GLS CLC2GLS
extern volatile uint32_t   CLC2GLS __attribute__((section("sfrs"), address(0xBF82D420)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC2GLSbits_t;
