Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gpg064.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t CNSTATD6:1;
    uint32_t :1;
    uint32_t CNSTATD8:1;
    uint32_t :3;
    uint32_t CNSTATD12:1;
    uint32_t CNSTATD13:1;
    uint32_t CNSTATD14:1;
    uint32_t CNSTATD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define CNNED CNNED
extern volatile uint32_t   CNNED __attribute__((section("sfrs"), address(0xBF8603A0)));
typedef struct {
  uint32_t :1;
  uint32_t CNNED1:1;
  uint32_t CNNED2:1;
  uint32_t CNNED3:1;
  uint32_t CNNED4:1;
  uint32_t CNNED5:1;
  uint32_t CNNED6:1;
  uint32_t :1;
  uint32_t CNNED8:1;
  uint32_t :3;
  uint32_t CNNED12:1;
  uint32_t CNNED13:1;
  uint32_t CNNED14:1;
  uint32_t CNNED15:1;
} __CNNEDbits_t;
extern volatile __CNNEDbits_t CNNEDbits __asm__ ("CNNED") __attribute__((section("sfrs"), address(0xBF8603A0)));
extern volatile uint32_t        CNNEDCLR __attribute__((section("sfrs"),address(0xBF8603A4)));
extern volatile uint32_t        CNNEDSET __attribute__((section("sfrs"),address(0xBF8603A8)));
extern volatile uint32_t        CNNEDINV __attribute__((section("sfrs"),address(0xBF8603AC)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF8603B0)));
typedef struct {
  uint32_t :1;
  uint32_t CNFD1:1;
  uint32_t CNFD2:1;
  uint32_t CNFD3:1;
  uint32_t CNFD4:1;
  uint32_t CNFD5:1;
  uint32_t CNFD6:1;
  uint32_t :1;
  uint32_t CNFD8:1;
  uint32_t :3;
  uint32_t CNFD12:1;
  uint32_t CNFD13:1;
  uint32_t CNFD14:1;
  uint32_t CNFD15:1;
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits __asm__ ("CNFD") __attribute__((section("sfrs"), address(0xBF8603B0)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF8603B4)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF8603B8)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF8603BC)));
#define SRCON0D SRCON0D
extern volatile uint32_t   SRCON0D __attribute__((section("sfrs"), address(0xBF8603C0)));
typedef struct {
  uint32_t :1;
  uint32_t SR0D1:1;
  uint32_t SR0D2:1;
  uint32_t SR0D3:1;
  uint32_t SR0D4:1;
  uint32_t SR0D5:1;
  uint32_t SR0D6:1;
  uint32_t :1;
  uint32_t SR0D8:1;
} __SRCON0Dbits_t;
extern volatile __SRCON0Dbits_t SRCON0Dbits __asm__ ("SRCON0D") __attribute__((section("sfrs"), address(0xBF8603C0)));
extern volatile uint32_t        SRCON0DCLR __attribute__((section("sfrs"),address(0xBF8603C4)));
extern volatile uint32_t        SRCON0DSET __attribute__((section("sfrs"),address(0xBF8603C8)));
extern volatile uint32_t        SRCON0DINV __attribute__((section("sfrs"),address(0xBF8603CC)));
#define SRCON1D SRCON1D
extern volatile uint32_t   SRCON1D __attribute__((section("sfrs"), address(0xBF8603D0)));
typedef struct {
  uint32_t :1;
  uint32_t SR1D1:1;
  uint32_t SR1D2:1;
  uint32_t SR1D3:1;
  uint32_t SR1D4:1;
  uint32_t SR1D5:1;
  uint32_t SR1D6:1;
  uint32_t :1;
  uint32_t SR1D8:1;
} __SRCON1Dbits_t;
extern volatile __SRCON1Dbits_t SRCON1Dbits __asm__ ("SRCON1D") __attribute__((section("sfrs"), address(0xBF8603D0)));
extern volatile uint32_t        SRCON1DCLR __attribute__((section("sfrs"),address(0xBF8603D4)));
extern volatile uint32_t        SRCON1DSET __attribute__((section("sfrs"),address(0xBF8603D8)));
extern volatile uint32_t        SRCON1DINV __attribute__((section("sfrs"),address(0xBF8603DC)));
#define ANSELE ANSELE
extern volatile uint32_t   ANSELE __attribute__((section("sfrs"), address(0xBF860400)));
typedef union {
  struct {
    uint32_t ANSE0:1;
    uint32_t ANSE1:1;
    uint32_t :6;
    uint32_t ANSE8:1;
    uint32_t ANSE9:1;
    uint32_t :2;
    uint32_t ANSE12:1;
    uint32_t ANSE13:1;
    uint32_t ANSE14:1;
    uint32_t ANSE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs"), address(0xBF860400)));
extern volatile uint32_t        ANSELECLR __attribute__((section("sfrs"),address(0xBF860404)));
extern volatile uint32_t        ANSELESET __attribute__((section("sfrs"),address(0xBF860408)));
extern volatile uint32_t        ANSELEINV __attribute__((section("sfrs"),address(0xBF86040C)));
#define TRISE TRISE
extern volatile uint32_t   TRISE __attribute__((section("sfrs"), address(0xBF860410)));
typedef union {
  struct {
    uint32_t TRISE0:1;
    uint32_t TRISE1:1;
    uint32_t :6;
    uint32_t TRISE8:1;
    uint32_t TRISE9:1;
    uint32_t :2;
    uint32_t TRISE12:1;
    uint32_t TRISE13:1;
    uint32_t TRISE14:1;
    uint32_t TRISE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISEbits_t;
extern volatile __TRISEbits_t TRISEbits __asm__ ("TRISE") __attribute__((section("sfrs"), address(0xBF860410)));
extern volatile uint32_t        TRISECLR __attribute__((section("sfrs"),address(0xBF860414)));
extern volatile uint32_t        TRISESET __attribute__((section("sfrs"),address(0xBF860418)));
extern volatile uint32_t        TRISEINV __attribute__((section("sfrs"),address(0xBF86041C)));
#define PORTE PORTE
extern volatile uint32_t   PORTE __attribute__((section("sfrs"), address(0xBF860420)));
typedef union {
  struct {
    uint32_t RE0:1;
    uint32_t RE1:1;
    uint32_t :6;
    uint32_t RE8:1;
    uint32_t RE9:1;
    uint32_t :2;
    uint32_t RE12:1;
    uint32_t RE13:1;
    uint32_t RE14:1;
    uint32_t RE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTEbits_t;
