Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gpg064.h
#define _CLC3CON_LCPOL_POSITION                  0x00000005
#define _CLC3CON_LCPOL_MASK                      0x00000020
#define _CLC3CON_LCPOL_LENGTH                    0x00000001

#define _CLC3CON_LCOUT_POSITION                  0x00000006
#define _CLC3CON_LCOUT_MASK                      0x00000040
#define _CLC3CON_LCOUT_LENGTH                    0x00000001

#define _CLC3CON_LCOE_POSITION                   0x00000007
#define _CLC3CON_LCOE_MASK                       0x00000080
#define _CLC3CON_LCOE_LENGTH                     0x00000001

#define _CLC3CON_INTN_POSITION                   0x0000000A
#define _CLC3CON_INTN_MASK                       0x00000400
#define _CLC3CON_INTN_LENGTH                     0x00000001

#define _CLC3CON_INTP_POSITION                   0x0000000B
#define _CLC3CON_INTP_MASK                       0x00000800
#define _CLC3CON_INTP_LENGTH                     0x00000001

#define _CLC3CON_ON_POSITION                     0x0000000F
#define _CLC3CON_ON_MASK                         0x00008000
#define _CLC3CON_ON_LENGTH                       0x00000001

#define _CLC3CON_G1POL_POSITION                  0x00000010
#define _CLC3CON_G1POL_MASK                      0x00010000
#define _CLC3CON_G1POL_LENGTH                    0x00000001

#define _CLC3CON_G2POL_POSITION                  0x00000011
#define _CLC3CON_G2POL_MASK                      0x00020000
#define _CLC3CON_G2POL_LENGTH                    0x00000001

#define _CLC3CON_G3POL_POSITION                  0x00000012
#define _CLC3CON_G3POL_MASK                      0x00040000
#define _CLC3CON_G3POL_LENGTH                    0x00000001

#define _CLC3CON_G4POL_POSITION                  0x00000013
#define _CLC3CON_G4POL_MASK                      0x00080000
#define _CLC3CON_G4POL_LENGTH                    0x00000001

#define _CLC3SEL_DS1_POSITION                    0x00000000
#define _CLC3SEL_DS1_MASK                        0x00000007
#define _CLC3SEL_DS1_LENGTH                      0x00000003

#define _CLC3SEL_DS2_POSITION                    0x00000004
#define _CLC3SEL_DS2_MASK                        0x00000070
#define _CLC3SEL_DS2_LENGTH                      0x00000003

#define _CLC3SEL_DS3_POSITION                    0x00000008
#define _CLC3SEL_DS3_MASK                        0x00000700
#define _CLC3SEL_DS3_LENGTH                      0x00000003

#define _CLC3SEL_DS4_POSITION                    0x0000000C
#define _CLC3SEL_DS4_MASK                        0x00007000
#define _CLC3SEL_DS4_LENGTH                      0x00000003

#define _CLC3GLS_G1D1N_POSITION                  0x00000000
#define _CLC3GLS_G1D1N_MASK                      0x00000001
#define _CLC3GLS_G1D1N_LENGTH                    0x00000001

#define _CLC3GLS_G1D1T_POSITION                  0x00000001
#define _CLC3GLS_G1D1T_MASK                      0x00000002
#define _CLC3GLS_G1D1T_LENGTH                    0x00000001

#define _CLC3GLS_G1D2N_POSITION                  0x00000002
#define _CLC3GLS_G1D2N_MASK                      0x00000004
#define _CLC3GLS_G1D2N_LENGTH                    0x00000001

#define _CLC3GLS_G1D2T_POSITION                  0x00000003
#define _CLC3GLS_G1D2T_MASK                      0x00000008
#define _CLC3GLS_G1D2T_LENGTH                    0x00000001

#define _CLC3GLS_G1D3N_POSITION                  0x00000004
#define _CLC3GLS_G1D3N_MASK                      0x00000010
#define _CLC3GLS_G1D3N_LENGTH                    0x00000001

#define _CLC3GLS_G1D3T_POSITION                  0x00000005
#define _CLC3GLS_G1D3T_MASK                      0x00000020
#define _CLC3GLS_G1D3T_LENGTH                    0x00000001

#define _CLC3GLS_G1D4N_POSITION                  0x00000006
#define _CLC3GLS_G1D4N_MASK                      0x00000040
#define _CLC3GLS_G1D4N_LENGTH                    0x00000001

#define _CLC3GLS_G1D4T_POSITION                  0x00000007
#define _CLC3GLS_G1D4T_MASK                      0x00000080
#define _CLC3GLS_G1D4T_LENGTH                    0x00000001

#define _CLC3GLS_G2D1N_POSITION                  0x00000008
#define _CLC3GLS_G2D1N_MASK                      0x00000100
#define _CLC3GLS_G2D1N_LENGTH                    0x00000001

#define _CLC3GLS_G2D1T_POSITION                  0x00000009
#define _CLC3GLS_G2D1T_MASK                      0x00000200
#define _CLC3GLS_G2D1T_LENGTH                    0x00000001

#define _CLC3GLS_G2D2N_POSITION                  0x0000000A
#define _CLC3GLS_G2D2N_MASK                      0x00000400
#define _CLC3GLS_G2D2N_LENGTH                    0x00000001

#define _CLC3GLS_G2D2T_POSITION                  0x0000000B
#define _CLC3GLS_G2D2T_MASK                      0x00000800
#define _CLC3GLS_G2D2T_LENGTH                    0x00000001

#define _CLC3GLS_G2D3N_POSITION                  0x0000000C
#define _CLC3GLS_G2D3N_MASK                      0x00001000
#define _CLC3GLS_G2D3N_LENGTH                    0x00000001

#define _CLC3GLS_G2D3T_POSITION                  0x0000000D
#define _CLC3GLS_G2D3T_MASK                      0x00002000
#define _CLC3GLS_G2D3T_LENGTH                    0x00000001

#define _CLC3GLS_G2D4N_POSITION                  0x0000000E
#define _CLC3GLS_G2D4N_MASK                      0x00004000
#define _CLC3GLS_G2D4N_LENGTH                    0x00000001

#define _CLC3GLS_G2D4T_POSITION                  0x0000000F
#define _CLC3GLS_G2D4T_MASK                      0x00008000
#define _CLC3GLS_G2D4T_LENGTH                    0x00000001

#define _CLC3GLS_G3D1N_POSITION                  0x00000010
#define _CLC3GLS_G3D1N_MASK                      0x00010000
#define _CLC3GLS_G3D1N_LENGTH                    0x00000001

#define _CLC3GLS_G3D1T_POSITION                  0x00000011
#define _CLC3GLS_G3D1T_MASK                      0x00020000
#define _CLC3GLS_G3D1T_LENGTH                    0x00000001

#define _CLC3GLS_G3D2N_POSITION                  0x00000012
#define _CLC3GLS_G3D2N_MASK                      0x00040000
#define _CLC3GLS_G3D2N_LENGTH                    0x00000001

#define _CLC3GLS_G3D2T_POSITION                  0x00000013
#define _CLC3GLS_G3D2T_MASK                      0x00080000
#define _CLC3GLS_G3D2T_LENGTH                    0x00000001

#define _CLC3GLS_G3D3N_POSITION                  0x00000014
#define _CLC3GLS_G3D3N_MASK                      0x00100000
#define _CLC3GLS_G3D3N_LENGTH                    0x00000001

#define _CLC3GLS_G3D3T_POSITION                  0x00000015
#define _CLC3GLS_G3D3T_MASK                      0x00200000
#define _CLC3GLS_G3D3T_LENGTH                    0x00000001

