Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gpg064.h
#define _ADCGIRQEN2_AGIEN33_POSITION             0x00000001
#define _ADCGIRQEN2_AGIEN33_MASK                 0x00000002
#define _ADCGIRQEN2_AGIEN33_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN34_POSITION             0x00000002
#define _ADCGIRQEN2_AGIEN34_MASK                 0x00000004
#define _ADCGIRQEN2_AGIEN34_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN35_POSITION             0x00000003
#define _ADCGIRQEN2_AGIEN35_MASK                 0x00000008
#define _ADCGIRQEN2_AGIEN35_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN36_POSITION             0x00000004
#define _ADCGIRQEN2_AGIEN36_MASK                 0x00000010
#define _ADCGIRQEN2_AGIEN36_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN37_POSITION             0x00000005
#define _ADCGIRQEN2_AGIEN37_MASK                 0x00000020
#define _ADCGIRQEN2_AGIEN37_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN38_POSITION             0x00000006
#define _ADCGIRQEN2_AGIEN38_MASK                 0x00000040
#define _ADCGIRQEN2_AGIEN38_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN39_POSITION             0x00000007
#define _ADCGIRQEN2_AGIEN39_MASK                 0x00000080
#define _ADCGIRQEN2_AGIEN39_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN40_POSITION             0x00000008
#define _ADCGIRQEN2_AGIEN40_MASK                 0x00000100
#define _ADCGIRQEN2_AGIEN40_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN41_POSITION             0x00000009
#define _ADCGIRQEN2_AGIEN41_MASK                 0x00000200
#define _ADCGIRQEN2_AGIEN41_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN45_POSITION             0x0000000D
#define _ADCGIRQEN2_AGIEN45_MASK                 0x00002000
#define _ADCGIRQEN2_AGIEN45_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN46_POSITION             0x0000000E
#define _ADCGIRQEN2_AGIEN46_MASK                 0x00004000
#define _ADCGIRQEN2_AGIEN46_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN47_POSITION             0x0000000F
#define _ADCGIRQEN2_AGIEN47_MASK                 0x00008000
#define _ADCGIRQEN2_AGIEN47_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN48_POSITION             0x00000010
#define _ADCGIRQEN2_AGIEN48_MASK                 0x00010000
#define _ADCGIRQEN2_AGIEN48_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN49_POSITION             0x00000011
#define _ADCGIRQEN2_AGIEN49_MASK                 0x00020000
#define _ADCGIRQEN2_AGIEN49_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN50_POSITION             0x00000012
#define _ADCGIRQEN2_AGIEN50_MASK                 0x00040000
#define _ADCGIRQEN2_AGIEN50_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN51_POSITION             0x00000013
#define _ADCGIRQEN2_AGIEN51_MASK                 0x00080000
#define _ADCGIRQEN2_AGIEN51_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN52_POSITION             0x00000014
#define _ADCGIRQEN2_AGIEN52_MASK                 0x00100000
#define _ADCGIRQEN2_AGIEN52_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN53_POSITION             0x00000015
#define _ADCGIRQEN2_AGIEN53_MASK                 0x00200000
#define _ADCGIRQEN2_AGIEN53_LENGTH               0x00000001

#define _ADCCSS1_CSS0_POSITION                   0x00000000
#define _ADCCSS1_CSS0_MASK                       0x00000001
#define _ADCCSS1_CSS0_LENGTH                     0x00000001

#define _ADCCSS1_CSS1_POSITION                   0x00000001
#define _ADCCSS1_CSS1_MASK                       0x00000002
#define _ADCCSS1_CSS1_LENGTH                     0x00000001

#define _ADCCSS1_CSS2_POSITION                   0x00000002
#define _ADCCSS1_CSS2_MASK                       0x00000004
#define _ADCCSS1_CSS2_LENGTH                     0x00000001

#define _ADCCSS1_CSS3_POSITION                   0x00000003
#define _ADCCSS1_CSS3_MASK                       0x00000008
#define _ADCCSS1_CSS3_LENGTH                     0x00000001

#define _ADCCSS1_CSS4_POSITION                   0x00000004
#define _ADCCSS1_CSS4_MASK                       0x00000010
#define _ADCCSS1_CSS4_LENGTH                     0x00000001

#define _ADCCSS1_CSS5_POSITION                   0x00000005
#define _ADCCSS1_CSS5_MASK                       0x00000020
#define _ADCCSS1_CSS5_LENGTH                     0x00000001

#define _ADCCSS1_CSS6_POSITION                   0x00000006
#define _ADCCSS1_CSS6_MASK                       0x00000040
#define _ADCCSS1_CSS6_LENGTH                     0x00000001

#define _ADCCSS1_CSS7_POSITION                   0x00000007
#define _ADCCSS1_CSS7_MASK                       0x00000080
#define _ADCCSS1_CSS7_LENGTH                     0x00000001

#define _ADCCSS1_CSS8_POSITION                   0x00000008
#define _ADCCSS1_CSS8_MASK                       0x00000100
#define _ADCCSS1_CSS8_LENGTH                     0x00000001

#define _ADCCSS1_CSS9_POSITION                   0x00000009
#define _ADCCSS1_CSS9_MASK                       0x00000200
#define _ADCCSS1_CSS9_LENGTH                     0x00000001

#define _ADCCSS1_CSS10_POSITION                  0x0000000A
#define _ADCCSS1_CSS10_MASK                      0x00000400
#define _ADCCSS1_CSS10_LENGTH                    0x00000001

#define _ADCCSS1_CSS11_POSITION                  0x0000000B
#define _ADCCSS1_CSS11_MASK                      0x00000800
#define _ADCCSS1_CSS11_LENGTH                    0x00000001

#define _ADCCSS1_CSS12_POSITION                  0x0000000C
#define _ADCCSS1_CSS12_MASK                      0x00001000
#define _ADCCSS1_CSS12_LENGTH                    0x00000001

#define _ADCCSS1_CSS13_POSITION                  0x0000000D
#define _ADCCSS1_CSS13_MASK                      0x00002000
#define _ADCCSS1_CSS13_LENGTH                    0x00000001

#define _ADCCSS1_CSS14_POSITION                  0x0000000E
#define _ADCCSS1_CSS14_MASK                      0x00004000
#define _ADCCSS1_CSS14_LENGTH                    0x00000001

#define _ADCCSS1_CSS15_POSITION                  0x0000000F
#define _ADCCSS1_CSS15_MASK                      0x00008000
#define _ADCCSS1_CSS15_LENGTH                    0x00000001

